{"chunk_id": "med#0001", "text": "What questions can you answer? I provide comprehensive foot health consultation services, including professional assessment and diagnosis of foot diseases (hallux valgus, flat feet, high arches, etc.), application of the FootAnalyzer intelligent analysis system, product descriptions for customized insoles and orthotics, foot care suggestions for various groups, and complete answers regarding treatment and prevention methods."}
{"chunk_id": "med#0002", "text": "The FootAnalyzer system features three core functions: hallux valgus angle analysis, automatic insole length measurement, and arch type determination, providing objective data support for foot health assessments."}
{"chunk_id": "med#0003", "text": "Hallux valgus refers to a convex bending deformity of the joint between the first metatarsal and the big toe. Typical symptoms include joint protrusion, compression deformity of the remaining toes, and foot pain. Thick skin and bursitis easily form at the protrusion, leading to swelling and inflammation due to friction when wearing shoes."}
{"chunk_id": "med#0004", "text": "According to domestic and foreign medical research, \"genetics\" is the greatest cause of hallux valgus. It is a deformity caused by the bone shape of the foot, which is primarily inherited from parents or elders. Many patients show toe joint curvature in childhood; without muscle exercise, this worsens with age, potentially evolving into severe toe deformities or overlapping toes."}
{"chunk_id": "med#0005", "text": "Foot characteristics prone to hallux valgus include: 1. Excessive spacing between the big toe and second toe; 2. Loose big toe ligaments (often familial); 3. Flat feet, which shift pressure to the inner side; 4. Longer big toes, which are easily squeezed in narrow-toed shoes."}
{"chunk_id": "med#0006", "text": "Long-term wear of incorrect shoes exacerbates hallux valgus, especially high heels and pointed shoes. If the first metatarsal is naturally deviated inward, narrow toe boxes create pressure that pulls the toe muscles like a bowstring, causing the toe to shift outward."}
{"chunk_id": "med#0007", "text": "Hallux valgus grading (HVA): Normal (<15°), Mild (15-25°), Moderate (25-40°), Severe (>40°). Professional grading also considers IMA (Intermetatarsal Angle): Normal (HVA<15°, IMA<9°), Mild (HVA 15-20°, IMA 9-11°), Moderate (HVA 20-40°, IMA 11-18°), Severe (HVA>40°, IMA>18°)."}
{"chunk_id": "med#0008", "text": "Mild hallux valgus can be improved by wearing health insoles and training foot muscle strength."}
{"chunk_id": "med#0009", "text": "Moderate hallux valgus can be improved using orthotics such as corrective insoles, hallux valgus braces, and toe separators, combined with health education exercises and avoiding narrow shoes."}
{"chunk_id": "med#0010", "text": "Severe hallux valgus usually requires surgery. Post-surgery, patients must still wear health insoles and use appropriate orthotics/exercises to prevent recurrence."}
{"chunk_id": "med#0011", "text": "General care for hallux valgus: 1. Choose wide-toed shoes with rocker designs; 2. Use orthotics to separate toes at night and support the arch; 3. Frequently exercise big toe muscles to strengthen joint support."}
{"chunk_id": "med#0012", "text": "Research on corrective sleeves shows that wearing them for at least a year can reduce the angle by up to 5°, though this is difficult for most. They are better for seniors unsuitable for surgery as they relieve pressure."}
{"chunk_id": "med#0013", "text": "The sole of the foot is the foundation of the body. Instability from hallux valgus can lead to skeletal misalignment, resulting in O-shaped legs, knee pain, shoulder stiffness, back pain, and migraines."}
{"chunk_id": "med#0014", "text": "Flat foot refers to a foot type where the medial longitudinal arch is too low or collapsed. The foot consists of 26 bones, 57 joints, 108 ligaments, and 32 muscles, forming arches to support body weight."}
{"chunk_id": "med#0015", "text": "The medial longitudinal arch acts as a shock absorber. In flat feet, stability and mobility decrease, increasing the load on the body during standing, running, or jumping."}
{"chunk_id": "med#0016", "text": "Congenital causes of flat feet include: 1. Tarsal coalition (e.g., calcaneal and talus bonding); 2. Congenital ligament laxity; 3. Hereditary factors; 4. Gender differences."}
{"chunk_id": "med#0017", "text": "Acquired causes of flat feet include: 1. Early weight-bearing (using walkers before 10 months); 2. Muscle/ligament weakness; 3. Developmental delays; 4. Poor posture (kneeling); 5. Obesity or pregnancy."}
{"chunk_id": "med#0018", "text": "Simple observation for flat feet: 1. Check for an arch while sitting (functional vs. structural flat foot); 2. Observe the arch while standing; 3. Check if the heel line tilts inward from behind."}
{"chunk_id": "med#0019", "text": "Professional testing includes: 1. Footprint/pressure scanning; 2. Big toe lift test (standing); 3. Observing hallux valgus as an indicator of unbalanced pressure."}
{"chunk_id": "med#0020", "text": "Most flat feet are asymptomatic, but some cause frequent falls or misalignment of the knees, pelvis, and spine, violating human biomechanics."}
{"chunk_id": "med#0021", "text": "Adult flat feet lose shock absorption, leading to fatigue, plantar fasciitis, toe pain, knee arthritis, and scoliosis. Solving the \"foundation\" (feet) is key to total body health."}
{"chunk_id": "med#0022", "text": "Most toddler flat feet require only observation and usually resolve by age 5-7. If combined with heel valgus, custom insoles should be provided by age 3."}
{"chunk_id": "med#0023", "text": "Surgery is rarely needed for children. For adults, the focus is on preventing further injury using insoles to support the arch and distribute pressure."}
{"chunk_id": "med#0024", "text": "Exercises for flat feet: 1. Walking barefoot on sand/grass; 2. Jumping rope/soccer; 3. Penguin walking (on heels); 4. Picking up objects with toes; 5. Towel scrunches."}
{"chunk_id": "med#0025", "text": "Prevention: Monitor children if elders have flat feet; avoid walkers before 10 months; avoid kneeling postures; encourage outdoor activities."}
{"chunk_id": "med#0026", "text": "Choosing shoes for children: Stable heel, 5-10mm extra length, wide toe box. Avoid buying over-the-counter insoles without professional evaluation."}
{"chunk_id": "med#0027", "text": "Normal flat feet need muscle strengthening; those with heel valgus need insoles plus exercise. Early detection is vital to ensure normal development."}
{"chunk_id": "med#0028", "text": "Shoe wear patterns reveal health. Normal wear occurs at the heel and toe. Abnormal patterns require full assessment of gait, pelvis, and leg length."}
{"chunk_id": "med#0029", "text": "Abnormal wear: 1. Excessive heel wear (leaning forward, high heels); 2. Inner side wear (flat feet); 3. Outer side wear (O-shaped legs/high arches)."}
{"chunk_id": "med#0030", "text": "Adjustments: Higher outer edges for O-legs; higher inner edges for X-legs. Orthotic insoles can alleviate discomfort. Bring old shoes to assessments."}
{"chunk_id": "med#0031", "text": "Seniors should choose slip-resistant, stable, and wide-toed shoes with soft interiors, upward-curved toes, and high tops to protect the ankles."}
{"chunk_id": "med#0032", "text": "Plantar fasciitis is often caused by overuse or fat pad atrophy in seniors. Protection includes resting, avoiding excessive pronation, and stretching."}
{"chunk_id": "med#0033", "text": "Shoes for plantar fasciitis: Good coverage, supportive, not too thin. Orthotics include insoles, night splints, and taping."}
{"chunk_id": "med#0034", "text": "Hallux valgus is influenced by genetics; hereditary factors plus poor shoe habits increase development risk."}
{"chunk_id": "med#0035", "text": "Testing for hallux valgus: The most direct method is measuring the degree of big toe deviation."}
{"chunk_id": "med#0036", "text": "Degree of hallux valgus: Classified into four levels based on HVA and IMA angles."}
{"chunk_id": "med#0037", "text": "Genetics is the primary cause of hallux valgus, determined by foot bone shapes inherited from ancestors."}
{"chunk_id": "med#0038", "text": "Incorrect shoes indirectly exacerbate the condition; many patients have curved joints since childhood."}
{"chunk_id": "med#0039", "text": "Spacing between the first two toes is the most important factor in hallux valgus formation."}
{"chunk_id": "med#0040", "text": "Mechanism: Improper squeezing causes joint deformation, often in families with low ligament stability."}
{"chunk_id": "med#0041", "text": "Flat feet and hallux valgus: Flat-footed individuals shift pressure inward, making them more prone to pain and deformity."}
{"chunk_id": "med#0042", "text": "High heels and pointed shoes squeeze the big toe, leading to bursitis, calluses, and arch collapse."}
{"chunk_id": "med#0043", "text": "Transverse arch collapse: Causes a wide, flat forefoot and claw toes due to inability to propel the body forward."}
{"chunk_id": "med#0044", "text": "Aggravating factors: Squeezing from small or pointed shoes leads to joint protrusion."}
{"chunk_id": "med#0045", "text": "Metatarsalgia: Caused by improper shoes, calluses, or toe deformities."}
{"chunk_id": "med#0046", "text": "Corns: Primarily caused by ill-fitting shoes (too small or pointed) and uneven pressure distribution."}
{"chunk_id": "med#0047", "text": "Normal hallux valgus: HVA < 15°, IMA < 9°."}
{"chunk_id": "med#0048", "text": "Mild hallux valgus: HVA 15-20°, IMA 9-11°."}
{"chunk_id": "med#0049", "text": "Moderate hallux valgus: HVA 20-40°, IMA 11-18°."}
{"chunk_id": "med#0050", "text": "Severe hallux valgus: HVA > 40°, IMA > 18°."}
{"chunk_id": "med#0051", "text": "IMA and deformity: People with naturally inward-leaning first metatarsals are at higher risk if wearing narrow shoes."}
{"chunk_id": "med#0052", "text": "Long big toes: More susceptible to being pushed outward in narrow-toed footwear."}
{"chunk_id": "med#0053", "text": "Ligament laxity: Lower joint stability leads to easier deformation under pressure."}
{"chunk_id": "med#0054", "text": "Treatment by degree: Mild (insoles/exercise); Moderate (braces/insoles); Severe (surgery/post-op care)."}
{"chunk_id": "med#0055", "text": "Consequences of no treatment: Affects aesthetics, gait, posture, and may lead to severe pain/isolation."}
{"chunk_id": "med#0056", "text": "Pressure distribution: Concentrated pressure on the big toe, combined with genetics, leads to deformity."}
{"chunk_id": "med#0057", "text": "Arch structure: The foot has three arches (medial, lateral, transverse); insoles must support all three."}
{"chunk_id": "med#0058", "text": "Transverse arch insoles: Provide forefoot support and disperse walking pressure."}
{"chunk_id": "med#0059", "text": "Posture: Poor posture and gait cause unbalanced pressure on specific foot areas."}
{"chunk_id": "med#0060", "text": "Insole decompression: Beyond support, insoles must be designed to absorb excess pressure."}
{"chunk_id": "med#0061", "text": "Customization: Necessary because every foot structure and walking need is unique."}
{"chunk_id": "med#0062", "text": "Fascia function: Covers 646 muscles; when used correctly, it fits perfectly without discomfort."}
{"chunk_id": "med#0063", "text": "Misuse of fascia: Poor posture or injury can cause fascia to lose elasticity or develop adhesions."}
{"chunk_id": "med#0064", "text": "Four roles of fascia: Shaping, supplying, moving, and transmitting."}
{"chunk_id": "med#0065", "text": "Shaping: Fascia wraps and fixes muscles; without it, muscles would lose their shape."}
{"chunk_id": "med#0066", "text": "Supply function: Sufficient fluid in fascia ensures flexibility, nerve conduction, and metabolism."}
{"chunk_id": "med#0067", "text": "Adhesions: Loss of water in fascia leads to poor metabolism and chronic inflammation."}
{"chunk_id": "med#0068", "text": "Sensory organ: Fascia contains many receptors and is the body's largest sensory organ."}
{"chunk_id": "med#0069", "text": "Pain center: Fascia contains many pain receptors; it is the information center for sensations."}
{"chunk_id": "med#0070", "text": "Relief: Soothing the fascia is the source of effective pain relief."}
{"chunk_id": "med#0071", "text": "High arch (Cavus foot): Characterized by an abnormally high medial longitudinal arch."}
{"chunk_id": "med#0072", "text": "Pressure points: Concentrated at the heel and forefoot, often creating a visible gap under the foot."}
{"chunk_id": "med#0073", "text": "Causes of high arch: Congenital genetics, muscle weakness, disease, trauma, or incorrect gait."}
{"chunk_id": "med#0074", "text": "Appearance: Prominent instep and larger gap from the ground; more common in females."}
{"chunk_id": "med#0075", "text": "Complications: Foot discomfort, neck/shoulder pain, calluses, plantar fasciitis, and scoliosis."}
{"chunk_id": "med#0076", "text": "Stability: Unbalanced weight distribution leads to outward rotation and poor joint stability."}
{"chunk_id": "med#0077", "text": "Biomechanics: Outward ankle tilt causes uneven calf muscle strain and reduced endurance."}
{"chunk_id": "med#0078", "text": "Injury risk: High arches shift center of gravity outward, making ankle sprains more likely."}
{"chunk_id": "med#0079", "text": "Gait: Difficulty shifting weight to the big toe, often feeling like 'rushing forward.'"}
{"chunk_id": "med#0080", "text": "Claw toes: Common in high arches due to neuromuscular imbalance affecting toe joints."}
{"chunk_id": "med#0081", "text": "Transverse arch collapse: High arches can lead to this, resulting in claw toes."}
{"chunk_id": "med#0082", "text": "Leg length: The more severe high arch side often corresponds to the shorter leg."}
{"chunk_id": "med#0083", "text": "O-legs: High medial arches push the knees outward, creating an O-shape."}
{"chunk_id": "med#0084", "text": "Back pain: Lower limb rotation leads to pelvic tilt and lumbar issues."}
{"chunk_id": "med#0085", "text": "Flat foot: Low or collapsed medial longitudinal arch."}
{"chunk_id": "med#0086", "text": "Complexity: The foot contains 26 bones, 57 joints, 108 ligaments, and 32 muscles."}
{"chunk_id": "med#0087", "text": "Arches: Provide stability and mobility to handle the body's weight load."}
{"chunk_id": "med#0088", "text": "Reduced function: Flat feet increase the load during standing, running, and jumping."}
{"chunk_id": "med#0089", "text": "Shock absorption: The inner arch provides elastic torque to adapt to various terrains."}
{"chunk_id": "med#0090", "text": "Rigid flat foot: Caused by congenital tarsal coalition (e.g., calcaneus-talus bonding)."}
{"chunk_id": "med#0091", "text": "Ligament laxity: Some children have systemic ligament looseness not limited to feet."}
{"chunk_id": "med#0092", "text": "In-utero factors: Restricted movement late in pregnancy can cause ligament laxity."}
{"chunk_id": "med#0093", "text": "Heredity: Studies show flat feet are often inherited from parents."}
{"chunk_id": "med#0094", "text": "Early weight-bearing: Using walkers before 10 months can delay arch development."}
{"chunk_id": "med#0095", "text": "Weakness: Many pediatric flat feet are due to weak posterior tibialis muscles."}
{"chunk_id": "med#0096", "text": "Delayed development: Premature birth or neurological conditions can slow arch formation."}
{"chunk_id": "med#0097", "text": "Posture: Prolonged kneeling can hinder arch development and cause X-legs."}
{"chunk_id": "med#0098", "text": "Weight: Obesity or pregnancy increases foot pressure, flattening the arch."}
{"chunk_id": "med#0099", "text": "Prevalence: Concentrated in ages 3-6; US (5%), Spain (5.95%)."}
{"chunk_id": "med#0100", "text": "Assessment: Checking arches while standing/sitting, heel observation, and pressure scans."}
{"chunk_id": "med#0101", "text": "Symptoms: Often asymptomatic, but some children fall frequently due to poor balance."}
{"chunk_id": "med#0102", "text": "Heel valgus: Causes unstable heel contact and abnormal pulling on knee ligaments."}
{"chunk_id": "med#0103", "text": "Adult issues: Fatigue, plantar fasciitis, and toe pain due to lost shock absorption."}
{"chunk_id": "med#0104", "text": "Natural recovery: Most childhood flat feet resolve by age 5-7 without treatment."}
{"chunk_id": "med#0105", "text": "Correction: Children with heel valgus should receive custom insoles at age 3."}
{"chunk_id": "med#0106", "text": "Adult management: Focus on preventing injury with insoles that support normal structure."}
{"chunk_id": "med#0107", "text": "W-sitting: Common in active toddlers (age 2-3) while playing on the floor."}
{"chunk_id": "med#0108", "text": "W-sitting description: Knees are in front, but the buttocks are on the floor with calves to the sides."}
{"chunk_id": "med#0109", "text": "W-sitting risks: Can lead to pigeon-toed gait (internal rotation), X-legs, and flat feet."}
{"chunk_id": "med#0110", "text": "X-legs: Resulting from tight inner thigh ligaments and weak outer thigh muscles."}
{"chunk_id": "med#0111", "text": "Genu Valgum (X-legs): Knees touch while ankles remain apart."}
{"chunk_id": "med#0112", "text": "Femoral torsion: W-sitting causes the femur to rotate inward during development."}
{"chunk_id": "med#0113", "text": "Combined issues: Changes in gait often lead to flat feet and heel misalignment."}
{"chunk_id": "med#0114", "text": "Biomechanics: Misalignment causes unbalanced pressure on the knee joints."}
{"chunk_id": "med#0115", "text": "Newborn legs: Normal newborns have a 10-15° inward curve (O-legs) due to in-utero positioning."}
{"chunk_id": "med#0116", "text": "Straightening: O-legs may peak when starting to walk but usually straighten by age 2."}
{"chunk_id": "med#0117", "text": "Shift to X-legs: Often peaks around age 4 before gradually returning to straight."}
{"chunk_id": "med#0118", "text": "Pendulum phenomenon: The natural developmental shift from O-legs to X-legs to straight."}
{"chunk_id": "med#0119", "text": "O-leg traits: Inward-turned kneecaps; ankles touch but knees remain apart."}
{"chunk_id": "med#0120", "text": "Pediatric X-legs: Linked to loose joints, flat feet with heel valgus, or W-sitting."}
{"chunk_id": "med#0121", "text": "X-leg traits: Outward-turned kneecaps; knees touch but ankles remain apart."}
{"chunk_id": "med#0122", "text": "Pathological: Gaps > 2 inches can cause pelvic rotation and femoral issues."}
{"chunk_id": "med#0123", "text": "Adult O-legs: Linked to aging and wear; often compensated by hallux valgus."}
{"chunk_id": "med#0124", "text": "Adult X-legs: Often due to lack of exercise in childhood or very tall stature."}
{"chunk_id": "med#0125", "text": "Adult management: Focus on preventing further degeneration since bones are fixed."}
{"chunk_id": "med#0126", "text": "In-toeing gait: Noticed when children trip over their own feet while walking."}
{"chunk_id": "med#0127", "text": "Prevalence: Common in clinical settings; ~10% of children aged 2-5."}
{"chunk_id": "med#0128", "text": "Normal gait: Feet are parallel or turned outward by about 10°."}
{"chunk_id": "med#0129", "text": "In-toeing issues: Feet point inward, causing them to tangle and lead to falls."}
{"chunk_id": "med#0130", "text": "Three causes: Metatarsus adductus, tibial torsion, or femoral anteversion."}
{"chunk_id": "med#0131", "text": "Tibial torsion: Common in ages 1-3; knees face forward but the lower leg turns in."}
{"chunk_id": "med#0132", "text": "Recovery: In-toeing due to tibial development is often physiological and self-correcting."}
{"chunk_id": "med#0133", "text": "Treatment: Required if tibial torsion persists after age 3 with angles > -45°."}
{"chunk_id": "med#0134", "text": "Femoral anteversion: Common in children aged 3-8."}
{"chunk_id": "med#0135", "text": "Femoral rotation: Around age 3, the femur turns inward; excessive rotation causes in-toeing."}
{"chunk_id": "med#0136", "text": "Acquired habits: Most femoral in-toeing is due to poor sitting/standing postures."}
{"chunk_id": "med#0137", "text": "Posture habits: Toddlers use W-sitting or kneeling for stability, which rotates the hips."}
{"chunk_id": "med#0138", "text": "Hip tension: Over-rotation of the femoral head leads to tight inner thigh muscles."}
{"chunk_id": "med#0139", "text": "Physiological age: In-toeing between 18-24 months is considered a normal stage."}
{"chunk_id": "med#0140", "text": "Integrated approach: Exercise, habit changes, and orthotics must be used together."}
{"chunk_id": "med#0141", "text": "Crucial habit: Cross-legged sitting must replace W-sitting/kneeling for treatment to work."}
{"chunk_id": "med#0142", "text": "Material: High-density open PU foam with 100% polyester antibacterial fabric."}
{"chunk_id": "med#0143", "text": "Properties: Breathable, moisture-wicking, flexible, and features a three-arch design."}
{"chunk_id": "med#0144", "text": "Heel cushioning: Resin material absorbs shock and supports weight distribution."}
{"chunk_id": "med#0145", "text": "Diabetic shoes: Removable insoles and rocker designs reduce pressure and pain."}
{"chunk_id": "med#0146", "text": "Toe protection: Extra wide and high toe boxes with hardened caps to prevent injury."}
{"chunk_id": "med#0147", "text": "Interior: Minimal seams to avoid friction; materials are leather or soft fabrics."}
{"chunk_id": "med#0148", "text": "Heel support: Reinforced for stability and protection of the hindfoot."}
{"chunk_id": "med#0149", "text": "Diabetic foot care: Special shoes and insoles are vital to reduce pressure ulcers."}
{"chunk_id": "med#0150", "text": "Prevention: Protective footwear prevents wounds caused by bumps or trauma."}
{"chunk_id": "med#0151", "text": "Metatarsalgia: Inflammation/pain in the forefoot, often mistaken for plantar fasciitis."}
{"chunk_id": "med#0152", "text": "Comparison: Plantar fasciitis pain is primarily in the hindfoot or heel."}
{"chunk_id": "med#0153", "text": "Morning pain: Plantar fasciitis often causes sharp pain during the first steps after waking."}
{"chunk_id": "med#0154", "text": "Triggers: Long standing, obesity, and running on uneven surfaces."}
{"chunk_id": "med#0155", "text": "Causes: Over-stretching of the fascia, excessive pronation, or sudden activity increases."}
{"chunk_id": "med#0156", "text": "Weight/Support: Pregnancy, obesity, and poor arch support contribute to the condition."}
{"chunk_id": "med#0157", "text": "Shoes/Gait: Hard soles, long-distance running, and heel spurs can cause arch pain."}
{"chunk_id": "med#0158", "text": "Management: Stretching (slant boards/straps) and supportive insoles to disperse pressure."}
{"chunk_id": "med#0159", "text": "Gait: Landing on the heel and shifting weight to the toe protects the spine and waist."}
{"chunk_id": "med#0160", "text": "Efficiency: Correct walking uses 80% of muscles and is the best full-body exercise."}
{"chunk_id": "med#0161", "text": "Benefits: Activates large muscle groups and promotes fat burning."}
{"chunk_id": "med#0162", "text": "High heels: Disrupt dynamic balance, leading to lumbar discomfort."}
{"chunk_id": "med#0163", "text": "Equilibrium: Breaking the body's natural balance causes back and neck pain."}
{"chunk_id": "med#0164", "text": "Compensation: Lumbar curvature increases to counter the forward tilt of high heels."}
{"chunk_id": "med#0165", "text": "Stress focus: Pressure concentrates on the 4th/5th vertebrae, causing chronic back pain."}
{"chunk_id": "med#0166", "text": "Calluses: Accumulation of dead skin cells that hardens on toes like a bone callus."}
{"chunk_id": "med#0167", "text": "Friction: Caused by persistent pressure and rubbing from shoes."}
{"chunk_id": "med#0168", "text": "Corns: Feels like a small stone in the shoe that causes sharp pain when walking."}
{"chunk_id": "med#0169", "text": "Demographic: Common in runners, dancers, or those wearing narrow shoes."}
{"chunk_id": "med#0170", "text": "Sesmoiditis: Pain at the base or bottom of the big toe."}
{"chunk_id": "med#0171", "text": "Risk factors: Long second toes, hammer toes, collapsed arches, and high heels."}
{"chunk_id": "med#0172", "text": "Aging: Impact from activity and thinning fat pads leads to increased pain."}
{"chunk_id": "med#0173", "text": "Leg length: Evaluators check for functional differences, manageable via exercise/insoles."}
{"chunk_id": "med#0174", "text": "Pediatric in-toeing: Frequent falling in school-age children often signals a foot issue."}
{"chunk_id": "med#0175", "text": "Evaluation: Medical professionals must identify if the cause is the feet, shins, or hips."}
{"chunk_id": "med#0176", "text": "Customization: Combining custom insoles with stretching yields the best results."}
{"chunk_id": "med#0177", "text": "Heel valgus: Identified when the heel line tilts inward rather than being vertical."}
{"chunk_id": "med#0178", "text": "Asymmetry: Uneven foot alignment can lead to pelvic tilt, in-toeing, and scoliosis."}
{"chunk_id": "med#0179", "text": "Fatigue: Muscle tension from poor alignment causes soreness and inability to stand long."}
{"chunk_id": "med#0180", "text": "Support: Insoles lift the arch and heel to restore correct alignment."}
{"chunk_id": "med#0181", "text": "Dr. Foot: A leader in custom insoles in Taiwan for over 20 years."}
{"chunk_id": "med#0182", "text": "Mission: To solve foot health issues and raise public awareness in Taiwan."}
{"chunk_id": "med#0183", "text": "Team: Includes physical therapists, orthotists, surgeons, and engineers."}
{"chunk_id": "med#0184", "text": "Innovation: Developed various biomechanical insoles and computer scanning systems."}
{"chunk_id": "med#0185", "text": "Quality: Received international patents and praise from global experts."}
{"chunk_id": "med#0186", "text": "Awards: Winner of the SNQ Bronze Award and the National Innovation Award."}
{"chunk_id": "med#0187", "text": "Customization: Focuses on personalized design so every user has a unique fit."}
{"chunk_id": "med#0188", "text": "Data-driven: Uses hundreds of thousands of data points for scientific design."}
{"chunk_id": "med#0189", "text": "Consultation: Provides professional assessments to identify specific foot needs."}
{"chunk_id": "med#0190", "text": "Education: Actively promotes foot health through lectures and campaigns."}
{"chunk_id": "med#0191", "text": "Sports: Supports professional athletes and Olympic teams to enhance performance."}
{"chunk_id": "med#0192", "text": "Philosophy: Foot health is the foundation of total body wellness."}
{"chunk_id": "med#0193", "text": "Intervention: Children with flat feet and heel valgus should get insoles by age 3."}
{"chunk_id": "med#0194", "text": "Timeline: Pediatric arches naturally form between ages 5 and 10."}
{"chunk_id": "med#0195", "text": "Golden Period: Ages 2-10 are critical for arch development and habit correction."}
{"chunk_id": "med#0196", "text": "Home Check: Observe arch height while sitting/standing and check heel alignment."}
{"chunk_id": "med#0197", "text": "Tracking: Use pressure scans to monitor developmental progress over time."}
{"chunk_id": "med#0198", "text": "High Risk: Inability to lift the big toe while standing at age 3+ may indicate flat feet."}
{"chunk_id": "med#0199", "text": "Balance: Asymmetric hallux valgus angles indicate uneven foot loading."}
{"chunk_id": "med#0200", "text": "Toddler Shoes: Wide toe box, flexible sole, and rocker design."}
{"chunk_id": "med#0201", "text": "Toddler Fit: High tops with laces or Velcro offer the best ankle support."}
{"chunk_id": "med#0202", "text": "Sizing: Leave 1.5cm of space; never choose oversized shoes; check fit monthly."}
{"chunk_id": "med#0203", "text": "Habit change: Replace W-sitting with cross-legged sitting."}
{"chunk_id": "med#0204", "text": "Butterfly Stretch: Sit with soles together, pull heels in, and press knees down."}
{"chunk_id": "med#0205", "text": "Importance: Without habit change, medical treatments are often ineffective."}
{"chunk_id": "med#0206", "text": "Dr. Foot Value: Professional assessment-based customization vs. generic options."}
{"chunk_id": "med#0207", "text": "Process: Involves foam casting, plaster molding, and manual modification."}
{"chunk_id": "med#0208", "text": "Time: Manual production takes approximately two weeks."}
{"chunk_id": "med#0209", "text": "Results: Improvement seen in 3-6 months; requires biannual follow-ups."}
{"chunk_id": "med#0210", "text": "Principle: Every step with the insole acts as a gentle corrective push."}
{"chunk_id": "med#0211", "text": "Adaptation: Expect a 1-4 week break-in period; adjustments available for discomfort."}
{"chunk_id": "med#0212", "text": "Lifespan: Children's insoles last ~1 year; adults' last 1-2 years."}
{"chunk_id": "med#0213", "text": "Durability: Some frames last 5 years with replaceable soft parts."}
{"chunk_id": "med#0214", "text": "Follow-up: Children need checks every 6 months to monitor development."}
{"chunk_id": "med#0215", "text": "Cleaning: Hand wash with soap/water; use soft brushes; do not soak."}
{"chunk_id": "med#0216", "text": "Drying: Air dry only; never use dryers, heaters, or irons."}
{"chunk_id": "med#0217", "text": "Morton's Neuroma: Nerve tissue thickening between metatarsals due to friction."}
{"chunk_id": "med#0218", "text": "Triggers: Narrow shoes, high heels, and incorrect posture during sports."}
{"chunk_id": "med#0219", "text": "Sensation: Feels like walking on a permanent, unremovable small pebble."}
{"chunk_id": "med#0220", "text": "Locations: Metatarsalgia (forefoot); Plantar Fasciitis (heel)."}
{"chunk_id": "med#0221", "text": "Risk Groups: Athletes, high-heel users, and flip-flop wearers."}
{"chunk_id": "med#0222", "text": "Progression: Usually chronic and gradual; pain often persists for over 6 months."}
{"chunk_id": "med#0223", "text": "Timing: Pain is most acute during the push-off phase of walking."}
{"chunk_id": "med#0224", "text": "Osteoarthritis: Early signs include stiffness and difficulty with stairs."}
{"chunk_id": "med#0225", "text": "Improvement: Weight loss and muscle strengthening can alleviate early symptoms."}
{"chunk_id": "med#0226", "text": "Pain mechanism: Calluses press on underlying nerves."}
{"chunk_id": "med#0227", "text": "Locations: Commonly found on toes, tips, and sides due to shoe pressure."}
{"chunk_id": "med#0228", "text": "Endurance: High arch users suffer calf fatigue due to poor biomechanics."}
{"chunk_id": "med#0229", "text": "Silicone: Medical-grade silicone insoles provide superior shock absorption."}
{"chunk_id": "med#0230", "text": "Blue silicone: Specifically targets high-pressure zones for standing or hiking."}
{"chunk_id": "med#0231", "text": "Professionals: Recommended for teachers, chefs, and factory workers."}
{"chunk_id": "med#0232", "text": "Diabetic Shoes: Must have wide/high toe boxes and reinforced protection."}
{"chunk_id": "med#0233", "text": "Material: Breathable leather or soft cloth is preferred to reduce irritation."}
{"chunk_id": "med#0234", "text": "Rocker sole: Reduces pressure on the foot during the walking cycle."}
{"chunk_id": "med#0235", "text": "Wound care: Insoles should allow for pressure relief near existing ulcers."}
{"chunk_id": "med#0236", "text": "Shopping: Buy shoes in the evening when feet are at their largest."}
{"chunk_id": "med#0237", "text": "Standard: If feet differ in size, always fit to the larger foot."}
{"chunk_id": "med#0238", "text": "Falls: Children fall more often if they have ligament laxity or flat feet."}
{"chunk_id": "med#0239", "text": "Heel tilt: Leads to unstable walking and pulling of the inner knee ligaments."}
{"chunk_id": "med#0240", "text": "High arch gait: Unbalanced weight leads to outward rotation and joint stress."}
{"chunk_id": "med#0241", "text": "Sprains: High arches shift weight outward, increasing the risk of ankle sprains."}
{"chunk_id": "med#0242", "text": "Callus Principle: Removal of friction via wide shoes and orthotics is essential."}
{"chunk_id": "med#0243", "text": "Environment: Use insoles and avoid tight socks to keep feet healthy."}
{"chunk_id": "med#0244", "text": "Comparison: Corn patches (slow) vs. cryotherapy (fast/expensive)."}
{"chunk_id": "med#0245", "text": "Recurrence: Prevented by wearing wide-toed shoes that allow toes to spread."}
{"chunk_id": "med#0246", "text": "Friction: Socks and arch insoles help distribute pressure and reduce rubbing."}
{"chunk_id": "med#0247", "text": "Ingrown nails: Prevented by avoiding narrow shoes and correct trimming."}
{"chunk_id": "med#0248", "text": "Protection: Treat nail fungus and wear sturdy toe caps to avoid trauma."}
{"chunk_id": "med#0249", "text": "Trimming: Cut nails straight across; do not round the corners into the folds."}
{"chunk_id": "med#0250", "text": "PRICE: Protect, Rest, Ice, Compression, Elevation for acute sprains."}
{"chunk_id": "med#0251", "text": "Compression: Wrap bandages from far to near to reduce swelling."}
{"chunk_id": "med#0252", "text": "Recovery: Ligaments take 1-3 months to recover depending on activity intensity."}
{"chunk_id": "med#0253", "text": "Rest: Immobilization is the best treatment if no fractures are present."}
{"chunk_id": "med#0254", "text": "Heat: Apply after 72 hours for 30 mins, 3 times a day."}
{"chunk_id": "med#0255", "text": "Exercises: Calf raises and squats help prevent re-injury after recovery."}
{"chunk_id": "med#0256", "text": "Diabetic protection: Footwear prevents trauma that could lead to wounds."}
{"chunk_id": "med#0257", "text": "Arch Routine: Includes 6 exercises to build muscle and induce arch formation."}
{"chunk_id": "med#0258", "text": "Sand walking: Great for building foot strength but avoid over-exertion."}
{"chunk_id": "med#0259", "text": "Games: Activities like jump rope or soccer stimulate arch development."}
{"chunk_id": "med#0260", "text": "Penguin walk: Walking on heels builds the tibialis anterior muscle."}
{"chunk_id": "med#0261", "text": "Dexterity: Use toes to pick up marbles, paper balls, or pencils."}
{"chunk_id": "med#0262", "text": "Resistance: Playing 'tug-of-war' or Rock-Paper-Scissors with toes."}
{"chunk_id": "med#0263", "text": "Diabetic care: Never walk barefoot; break in new shoes slowly."}
{"chunk_id": "med#0264", "text": "Posture: Heel-to-toe walking protects the back and spine."}
{"chunk_id": "med#0265", "text": "Full-body: Walking correctly keeps the pelvis aligned and the body upright."}
{"chunk_id": "med#0266", "text": "Activation: Uniformly uses muscles from the heel through the toe."}
{"chunk_id": "med#0267", "text": "Practice: Walk 30-60 mins daily with focused heel-to-toe movements."}
{"chunk_id": "med#0268", "text": "Background: Dr. Foot is Taiwan's leader in custom orthotics."}
{"chunk_id": "med#0269", "text": "Specialists: The team consists of therapists, surgeons, and designers."}
{"chunk_id": "med#0270", "text": "Verification: Insoles are verified for pressure reduction effects."}
{"chunk_id": "med#0271", "text": "Medical: Licensed as a Class I Medical Device in Taiwan."}
{"chunk_id": "med#0272", "text": "Fit: Customized to ensure maximum comfort and therapeutic effect."}
{"chunk_id": "med#0273", "text": "Booking: Assessments take 30-50 minutes and require an appointment."}
{"chunk_id": "med#0274", "text": "Scope: Evaluation includes posture, foot structure, and computer scanning."}
{"chunk_id": "med#0275", "text": "Summary: Grading is based on HVA and IMA angles from normal to severe."}
{"chunk_id": "med#0276", "text": "Mild Care: Improved via health insoles and muscle training."}
{"chunk_id": "med#0277", "text": "Moderate Care: Uses braces and dividers combined with exercises."}
{"chunk_id": "med#0278", "text": "Severe Care: Typically requires surgery followed by orthotic support."}
{"chunk_id": "med#0279", "text": "Factors: Genetic risk combined with poor footwear habits leads to development."}
{"chunk_id": "med#0280", "text": "Japanese Design: PU foam insoles offer breathable and high-elasticity performance."}
{"chunk_id": "med#0281", "text": "Materials: EVA body with rubber decompression pads and polyester cloth."}
{"chunk_id": "med#0282", "text": "Washable: Hand wash and air dry; avoid heat/ironing."}
{"chunk_id": "med#0283", "text": "Shock: Heel resin materials reduce impact during running and walking."}
{"chunk_id": "med#0284", "text": "Flatness: Defined by a collapsed or abnormally low medial arch."}
{"chunk_id": "med#0285", "text": "Anatomy: The foot consists of 26 bones and 108 ligaments forming arches."}
{"chunk_id": "med#0286", "text": "Rigid: Congenital bone bonding causes rigid flat feet in some children."}
{"chunk_id": "med#0287", "text": "Walkers: Premature use of walkers can delay natural arch formation."}
{"chunk_id": "med#0288", "text": "Penguin Exercise: Helps induce arch formation via muscle strength."}
{"chunk_id": "med#0289", "text": "Towel Game: Using toes to pull objects develops intrinsic foot muscles."}
{"chunk_id": "med#0290", "text": "Standing Check: Observe if the arch is visible or flat against the floor."}
{"chunk_id": "med#0291", "text": "Location: Forefoot pain = Metatarsalgia; Hindfoot/Heel pain = Fasciitis."}
{"chunk_id": "med#0292", "text": "Fascia: Covers 646 muscles; misuse leads to painful adhesions."}
{"chunk_id": "med#0293", "text": "High arch: Also known as 'pes cavus' or hollow foot."}
{"chunk_id": "med#0294", "text": "Pressure: Concentrated on the heel and forefoot ball."}
{"chunk_id": "med#0295", "text": "Body Impact: High arches can cause scoliosis and chronic shoulder pain."}
{"chunk_id": "med#0296", "text": "Mechanics: Outward tilt causes poor endurance and lateral calf soreness."}
{"chunk_id": "med#0297", "text": "Claw Deformity: Imbalance in muscle tension causes toes to bend into a claw shape."}
{"chunk_id": "med#0298", "text": "Protective Shoe: Diabetic shoes must have high/wide space and hardened toe caps."}
{"chunk_id": "med#0299", "text": "Professionalism: True assessment requires medical literacy and orthotic training."}
{"chunk_id": "med#0300", "text": "Thoroughness: A complete evaluation takes 30+ minutes for imaging and gait analysis."}
{"chunk_id": "med#0301", "text": "Foundation: Foot problems cause neck/waist issues; 'wrong feet, wrong body.'"}